<!-- 1. Import Library -->
Pada Tahap ini kita akan import library yang dibutuhkan

In [2]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, StandardScaler

<!-- 2. Dowload dan Load Dataset -->
Mendowload Dataset dari Kaggle,
Lalu memasukkan dataset yang ingin diolah

In [5]:
df = pd.read_csv("dataset_contoh.csv")
print(df)
df.head()

      Name  Gender   Age       City Department     Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    Karachi    Finance  125917.01   ahmed48@gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com
19   Tariq    Male   NaN     Lahore        HR         NaN   tariq17@gmail.com

     Name  Gender   Age     City Department     Salary               Email
0   Tariq    Male  47.0  Karachi     Sales   123609.72   tariq76@gmail.com
1    Hina  Female  26.0   Quetta         HR  125683.94    hina90@gmail.com
2   Usman    Male  36.0   lahore     Sales         NaN   usman71@gmail.com
3    Sana  Female  21.0   Quetta    Finance  147901.41    sana72@gmail.com
4  Ayesha    Male  40.0   lahore         HR  123880.80  ayesha25@gmail.com

<!-- 3. EDA -->

In [6]:
df.info()
df.describe(include='all')
df.isnull().sum()
df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Gender      20 non-null     object
 2   Age         7 non-null      float64
 3   City        20 non-null     object
 4   Department  20 non-null     object
 5   Salary      14 non-null     float64
 6   Email       20 non-null     object
dtypes: float64(2), object(5)
memory usage: 1.2+ KB

np.int64(0)

<!-- 4. Data Cleaning -->

<!-- Menghapus Duplikat -->

In [7]:
df = df.drop_duplicates()
print("\n=== Data Setelah Dihapus Duplikat ===")
print(df)

=== Data Setelah Dihapus Duplikat ===
      Name  Gender   Age       City Department     Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    Karachi    Finance  125917.01   ahmed48@gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com
19   Tariq    Male   NaN     Lahore        HR         NaN   tariq17@gmail.com

<!-- Missing Value -->

In [13]:
# df = pd.read_csv("dataset_contoh.csv")
# print("\n=== Data Sebelum Menangani Nilai Hilang ===")
# print(df)

df['Age'] = df['Age'].fillna(df['Age'].median())
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
df['Department'] = df['Department'].fillna(df['Department'].mode()[0])
print("\n=== Data Setelah Menangani Nilai Hilang ===")
print(df)

=== Data Setelah Menangani Nilai Hilang ===
      Name  Gender   Age       City Department         Salary  \
0    Tariq    Male  47.0    Karachi     Sales   123609.720000
1     Hina  Female  26.0     Quetta         HR  125683.940000
2    Usman    Male  36.0     lahore     Sales   105991.486429
3     Sana  Female  21.0     Quetta    Finance  147901.410000
4   Ayesha    Male  40.0     lahore         HR  123880.800000
5    Ahmed    Male  40.0     Quetta    Finance   50115.700000
6    Bilal  Female  60.0   Peshawar    Finance   32984.180000
7    Ahmed  Female  40.0     Quetta         IT  105991.486429
8    Usman    Male  40.0     Quetta      Sales  105991.486429
9     Sara  Female  40.0  Islamabad    Finance  127273.370000
10   Ahmed  Female  40.0    Karachi    Finance  125917.010000
11   Ahmed    Male  40.0     Quetta    Finance   43153.970000
12    Sana    Male  49.0    Karachi      Sales  128192.850000
13     Ali  Female  40.0   Peshawar         HR  133554.550000
14   Usman  Female  40.0  Islamabad  Marketing   39515.870000
15   Ahmed  Female  40.0     Quetta      Sales  105991.486429
16   Usman  Female  40.0     Lahore         IT  132153.370000
17   Bilal    Male  40.0     Quetta         IT  149944.070000
18    Sara  Female  40.0    Karachi         HR  105991.486429
19   Tariq    Male  40.0     Lahore        HR   105991.486429

                 Email
0    tariq76@gmail.com
1     hina90@gmail.com
2    usman71@gmail.com
3     sana72@gmail.com
4   ayesha25@gmail.com
5    ahmed33@gmail.com
6    bilal93@gmail.com
7    ahmed89@gmail.com
8    usman35@gmail.com
9     sara73@gmail.com
10   ahmed48@gmail.com
11   ahmed44@gmail.com
12    sana54@gmail.com
13     ali88@gmail.com
14    usman3@gmail.com
15   ahmed40@gmail.com
16   usman15@gmail.com
17   bilal71@gmail.com
18    sara96@gmail.com
19   tariq17@gmail.com

<!-- Inconsisstance Format -->